Revit 2027 API
BuiltInFailures.ScheduleViewFailures.SegmentsStartIsGreaterThanSegmentsEnd Property
 Change values so Segments End is greater than or equal to Segments Start.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SegmentsStartIsGreaterThanSegmentsEnd { get; }
Public Shared ReadOnly Property SegmentsStartIsGreaterThanSegmentsEnd As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SegmentsStartIsGreaterThanSegmentsEnd {
	FailureDefinitionId^ get ();
}
static member SegmentsStartIsGreaterThanSegmentsEnd : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ScheduleViewFailures Class
Autodesk.Revit.DB Namespace